espressif/esp-mqtt/test/host/sdkconfig.defaults
CONFIG_IDF_TARGET="linux"
CONFIG_MQTT_PROTOCOL_5=y
CONFIG_MQTT_USE_CUSTOM_CONFIG=y
CONFIG_MQTT_EVENT_QUEUE_SIZE=2
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=0
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=n
CONFIG_LOG_COLORS=n
